/**
  ******************************************************************************
  * @file    Project/ucosii stm32f4 mdk475/user/current_trace.h 
  * @author  Kuangjing
  * @version ucosii
  * @date    20180809
  * @brief   电流环跟随一个预定电流	电流信号0.5A-1A  频率为10Hz
  ******************************************************************************
  ******************************************************************************
  */

#ifndef		__CURRENT_TRACE_H
#define		__CURRENT_TRACE_H


#include	"stm32f4xx.h"








#endif





/**************************************END OF FILE******************************************/

