/**
  ******************************************************************************
  * @file    Project/user/hallreversal.c 
  * @author  Kuangjing
  * @version ucosii
  * @date    20170509
  * @brief   霍尔换向表以及对应换向寄存器操作
  ******************************************************************************
  ******************************************************************************
  */
#include	"stm32f4xx.h"
#include	"stm32f4xx_gpio.h"
#include	"stm32f4xx_tim.h"
#include	"global_parameters.h"
#include	"hall_reversal_6steps.h"

  
  



/* Private functions ---------------------------------------------------------*/
//CH1	无效电平为高--------------------------------------------------------------------------------------------------
	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH1_OFF_CH1N_ON(void)
	参数含义			：null
	函数功能			：上桥臂关		下桥臂开
	----------------------------------------------------------------------------*/
void	TIM1_CH1_OFF_CH1N_ON(void)
{
	TIM1->CCER &=0xFFFE;			//CCER->CC1E	= 0
	TIM1->CCER |=0x0004;			//CCER->CC1NE	= 1
	TIM1->CCMR1 &= 0xFF8F;
	TIM1->CCMR1 |= 0x0040;			//强制OC1输出无效电平
}

	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH1_OFF_CH1N_OFF(void)
	参数含义			：null
	函数功能			：上桥臂关		下桥臂关
	----------------------------------------------------------------------------*/
void	TIM1_CH1_OFF_CH1N_OFF(void)
{
	TIM1->CCER &=0xFFFE;			//CCER->CC1E	= 0
	TIM1->CCER &=0xFFFB;			//CCER->CC1NE	= 0
	TIM1->CCMR1 &= 0xFF8F;
	TIM1->CCMR1 |= 0x0040;			//强制OC1输出无效电平
}

	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH1_ON_CH1N_OFF(void)
	参数含义			：null
	函数功能			：上桥臂开		下桥臂关
	----------------------------------------------------------------------------*/
void	TIM1_CH1_ON_CH1N_OFF(void)
{
	TIM1->CCER |=0x0001;			//CCER->CC1E	= 1
	TIM1->CCER &=0xFFFB;			//CCER->CC1NE	= 0
	TIM1->CCMR1 &= 0xFF8F;
	TIM1->CCMR1 |= 0x0040;			//强制OC1输出无效电平
}

	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH1_OFF_CH1N_PWM(void)
	参数含义			：null
	函数功能			：上桥臂关		下桥臂pwm
	----------------------------------------------------------------------------*/
void	TIM1_CH1_OFF_CH1N_PWM(void)
{
	TIM1->CCMR1 &= 0xFF8F;
	TIM1->CCMR1 |= 0x0070;			//OC1为PWM2模式
	TIM1->CCER &=0xFFFE;			//CCER->CC1E	=	0
	TIM1->CCER |=0x0004;			//CCER->CC1NE	=	1
}


	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH1_PWM_CH1N_OFF(void)
	参数含义			：null
	函数功能			：上桥臂pwm		下桥臂关
	----------------------------------------------------------------------------*/
void	TIM1_CH1_PWM_CH1N_OFF(void)
{
	TIM1->CCMR1 &= 0xFF8F;
	TIM1->CCMR1 |= 0x0070;			//OC1为PWM2模式
	TIM1->CCER |=0x0001;			//CCER->CC1E	=	1
	TIM1->CCER &=0xFFFB;			//CCER->CC1NE	=	0
}

//CH2------------------------------------------------------------------------------------------------------------------
	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH2_OFF_CH2N_ON(void)
	参数含义			：null
	函数功能			：上桥臂关		下桥臂开
	----------------------------------------------------------------------------*/
void	TIM1_CH2_OFF_CH2N_ON(void)
{
	TIM1->CCER &=0xFFEF;			//CCER->CC2E	= 0
	TIM1->CCER |=0x0040;			//CCER->CC2NE	= 1
	TIM1->CCMR1 &= 0x8FFF;
	TIM1->CCMR1 |= 0x4000;			//强制OC1输出无效电平
}

	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH2_OFF_CH2N_OFF(void)
	参数含义			：null
	函数功能			：上桥臂关		下桥臂关
	----------------------------------------------------------------------------*/
void	TIM1_CH2_OFF_CH2N_OFF(void)
{
	TIM1->CCER &=0xFFEF;			//CCER->CC2E	= 0
	TIM1->CCER &=0xFFBF;			//CCER->CC2NE	= 0
	TIM1->CCMR1 &= 0x8FFF;
	TIM1->CCMR1 |= 0x4000;			//强制OC1输出无效电平
}

	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH2_ON_CH2N_OFF(void)
	参数含义			：null
	函数功能			：上桥臂开		下桥臂关
	----------------------------------------------------------------------------*/
void	TIM1_CH2_ON_CH2N_OFF(void)
{
	TIM1->CCER |=0x0010;			//CCER->CC2E	= 1
	TIM1->CCER &=0xFFBF;			//CCER->CC2NE	= 0
	TIM1->CCMR1 &= 0x8FFF;
	TIM1->CCMR1 |= 0x4000;			//强制OC2输出无效电平
}

	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH2_OFF_CH2N_PWM(void)
	参数含义			：null
	函数功能			：上桥臂关		下桥臂pwm
	----------------------------------------------------------------------------*/
void	TIM1_CH2_OFF_CH2N_PWM(void)
{
	TIM1->CCMR1 &= 0x8FFF;
	TIM1->CCMR1 |= 0x7000;			//OC2为PWM2模式
	TIM1->CCER &=0xFFEF;			//CCER->CC2E	=	0
	TIM1->CCER |=0x0040;			//CCER->CC2NE	=	1
}


	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH2_PWM_CH2N_OFF(void)
	参数含义			：null
	函数功能			：上桥臂pwm		下桥臂关
	----------------------------------------------------------------------------*/
void	TIM1_CH2_PWM_CH2N_OFF(void)
{
	TIM1->CCMR1 &= 0x8FFF;
	TIM1->CCMR1 |= 0x7000;			//OC2为PWM2模式
	TIM1->CCER |=0x0010;			//CCER->CC2E	=	1
	TIM1->CCER &=0xFFBF;			//CCER->CC2NE	=	0
}
//CH3-------------------------------------------------------------------------------------------------------------------------
	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH3_OFF_CH3N_ON(void)
	参数含义			：null
	函数功能			：上桥臂关		下桥臂开
	----------------------------------------------------------------------------*/
void	TIM1_CH3_OFF_CH3N_ON(void)
{
	TIM1->CCER &=0xFEFF;			//CCER->CC3E	= 0
	TIM1->CCER |=0x0400;			//CCER->CC3NE	= 1
	TIM1->CCMR2 &= 0xFF8F;
	TIM1->CCMR2 |= 0x0040;			//强制OC3输出无效电平
}

	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH3_OFF_CH3N_OFF(void)
	参数含义			：null
	函数功能			：上桥臂关		下桥臂关
	----------------------------------------------------------------------------*/
void	TIM1_CH3_OFF_CH3N_OFF(void)
{
	TIM1->CCER &=0xFEFF;			//CCER->CC3E	= 0
	TIM1->CCER &=0xFBFF;			//CCER->CC3NE	= 0
	TIM1->CCMR2 &= 0xFF8F;
	TIM1->CCMR2 |= 0x0040;			//强制OC3输出无效电平
}

	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH3_ON_CH3N_OFF(void)
	参数含义			：null
	函数功能			：上桥臂开		下桥臂关
	----------------------------------------------------------------------------*/
void	TIM1_CH3_ON_CH3N_OFF(void)
{
	TIM1->CCER |=0x0100;			//CCER->CC3E	= 1
	TIM1->CCER &=0xFBFF;			//CCER->CC3NE	= 0
	TIM1->CCMR2 &= 0xFF8F;
	TIM1->CCMR2 |= 0x0040;			//强制OC3输出无效电平
}

	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH3_OFF_CH3N_PWM(void)
	参数含义			：null
	函数功能			：上桥臂关		下桥臂pwm
	----------------------------------------------------------------------------*/
void	TIM1_CH3_OFF_CH3N_PWM(void)
{
	TIM1->CCMR2 &= 0xFF8F;
	TIM1->CCMR2 |= 0x0070;			//OC3为PWM2模式
	TIM1->CCER &=0xFEFF;			//CCER->CC3E	=	0
	TIM1->CCER |=0x0400;			//CCER->CC3NE	=	1
}


	/*---------------------------------------------------------------------------
	函数名称			：TIM1_CH3_PWM_CH3N_OFF(void)
	参数含义			：null
	函数功能			：上桥臂pwm		下桥臂关
	----------------------------------------------------------------------------*/
void	TIM1_CH3_PWM_CH3N_OFF(void)
{
	TIM1->CCMR2 &= 0xFF8F;
	TIM1->CCMR2 |= 0x0070;			//OC3为PWM2模式
	TIM1->CCER |=0x0100;			//CCER->CC3E	=	1
	TIM1->CCER &=0xFBFF;			//CCER->CC3NE	=	0
}

/*空换向表，不会运行此步*********************************************************/
const void NULL_Switch(void)
{
	return;
}	
//clock wise//////////////////////////////////////////////////////////////////////
/*关闭H1，打开H2*****************************************************************/
const void	CW_H2_L3(void)		
{
	TIM1->CCER &=0xFFFE;			//CCER->CC1E	=	0	TIM1 CH1 关闭
	TIM1->CCER |=0x0010;			//CCER->CC2E	=	1	TIM1 CH2 使能
	return;
}
/*关闭H3，打开H1*****************************************************************/
const void	CW_H1_L2(void)
{
	TIM1->CCER &=0xFEFF;			//CCER->CC3E	=	0	TIM1 CH3 关闭
	TIM1->CCER |=0x0001;			//CCER->CC1E	=	1	TIM1 CH1 使能
	return;
}
/*关闭L2，打开L3*****************************************************************/
const void	CW_H1_L3(void)
{
	TIM1->CCER &=0xFFBF;			//CCER->CC2NE	=	0	TIM1 CH2N关闭
	TIM1->CCER |=0x0400;			//CCER->CC3NE	=	1	TIM1 CH3N使能
	return;
}
/*关闭H2，打开H3*****************************************************************/
const void	CW_H3_L1(void)
{
	TIM1->CCER &=0xFFEF;			//CCER->CC2E	=	0	TIM1 CH2 关闭
	TIM1->CCER |=0x0100;			//CCER->CC3E	=	1	TIM1 CH3 使能
	return;
}
/*关闭L3，打开L1*****************************************************************/
const void	CW_H2_L1(void)
{
	TIM1->CCER &=0xFBFF;			//CCER->CC3NE	= 	0	TIM1 CH3N关闭
	TIM1->CCER |=0x0001;			//CCER->CC1E	=	1	TIM1 CH1N使能
	return;
}
/*关闭L1，打开L2*****************************************************************/
const void	CW_H3_L2(void)
{
	TIM1->CCER &=0xFFFB;			//CCER->CC1NE	=	0	TIM1 CH1N关闭
	TIM1->CCER |=0x0040;			//CCER->CC2NE	=	1	TIM1 CH2N打开
	return;
}

//counter clock wise//////////////////////////////////////////////////////////////
/*关闭L1，打开L3*****************************************************************/
const void	CCW_H2_L3(void)		
{
	TIM1->CCER &=0xFFFB;			//CCER->CC1NE	=	0	TIM1 CH1N关闭
	TIM1->CCER |=0x0400;			//CCER->CC3NE	=	1	TIM1 CH3N使能
	return;
}
/*关闭L3，打开L2*****************************************************************/
const void	CCW_H1_L2(void)
{
	TIM1->CCER &=0xFBFF;			//CCER->CC3NE	= 	0	TIM1 CH3N关闭
	TIM1->CCER |=0x0040;			//CCER->CC2NE	=	1	TIM1 CH2N打开
	return;
}
/*关闭H2，打开H1*****************************************************************/
const void	CCW_H1_L3(void)
{
	TIM1->CCER &=0xFFEF;			//CCER->CC2E	=	0	TIM1 CH2 关闭
	TIM1->CCER |=0x0001;			//CCER->CC1E	=	1	TIM1 CH1 使能
	return;
}
/*关闭L2，打开L1*****************************************************************/
const void	CCW_H3_L1(void)
{
	TIM1->CCER &=0xFFBF;			//CCER->CC2NE	=	0	TIM1 CH2N关闭
	TIM1->CCER |=0x0001;			//CCER->CC1E	=	1	TIM1 CH1N使能
	return;
}
/*关闭H3，打开H2*****************************************************************/
const void	CCW_H2_L1(void)
{
	TIM1->CCER &=0xFEFF;			//CCER->CC3E	=	0	TIM1 CH3 关闭
	TIM1->CCER |=0x0010;			//CCER->CC2E	=	1	TIM1 CH2 使能
	return;
}
/*关闭H1，打开H3*****************************************************************/
const void	CCW_H3_L2(void)
{
	TIM1->CCER &=0xFFFE;			//CCER->CC1E	=	0	TIM1 CH1 关闭
	TIM1->CCER |=0x0100;			//CCER->CC3E	=	1	TIM1 CH3 使能
	return;
}


	/*---------------------------------------------------------------------------
	函数名称			：H1_L2(void)
	参数含义			：null
	函数功能			：H1和L2导通
	----------------------------------------------------------------------------*/
const void	H1_L2(void)
{
	TIM1_CH1_PWM_CH1N_OFF();
	TIM1_CH2_OFF_CH2N_PWM();
	TIM1_CH3_OFF_CH3N_OFF();
	return;
}


	/*---------------------------------------------------------------------------
	函数名称			：H1_L3(void)
	参数含义			：null
	函数功能			：H1和L3导通
	----------------------------------------------------------------------------*/
const void	H1_L3(void)
{
	TIM1_CH1_PWM_CH1N_OFF();
	TIM1_CH2_OFF_CH2N_OFF();
	TIM1_CH3_OFF_CH3N_PWM();
	return;
}


	/*---------------------------------------------------------------------------
	函数名称			：H2_L1(void)
	参数含义			：null
	函数功能			：H2和L1导通
	----------------------------------------------------------------------------*/
const void	H2_L1(void)
{
	TIM1_CH1_OFF_CH1N_PWM();
	TIM1_CH2_PWM_CH2N_OFF();
	TIM1_CH3_OFF_CH3N_OFF();
	return;
}


	/*---------------------------------------------------------------------------
	函数名称			：H2_L3(void)
	参数含义			：null
	函数功能			：H2和L3导通
	----------------------------------------------------------------------------*/
const void	H2_L3(void)
{
	TIM1_CH1_OFF_CH1N_OFF();
	TIM1_CH2_PWM_CH2N_OFF();
	TIM1_CH3_OFF_CH3N_PWM();
	return;
}


	/*---------------------------------------------------------------------------
	函数名称			：H3_L1(void)
	参数含义			：null
	函数功能			：H3和L1导通
	----------------------------------------------------------------------------*/
const void	H3_L1(void)
{
	TIM1_CH1_OFF_CH1N_PWM();
	TIM1_CH2_OFF_CH2N_OFF();
	TIM1_CH3_PWM_CH3N_OFF();
	return;
}


	/*---------------------------------------------------------------------------
	函数名称			：H3_L2(void)
	参数含义			：null
	函数功能			：H3和L2导通
	----------------------------------------------------------------------------*/
const void	H3_L2(void)
{
	TIM1_CH1_OFF_CH1N_OFF();
	TIM1_CH2_OFF_CH2N_PWM();
	TIM1_CH3_PWM_CH3N_OFF();
	return;
}

/* Private variables ---------------------------------------------------------*/
const	void	(*runtime_switch_table[2][8])()			=	{	{NULL_Switch,	CW_H2_L3,		CW_H1_L2,		CW_H1_L3,		CW_H3_L1,		CW_H2_L1,		CW_H3_L2,	NULL_Switch},
																{NULL_Switch,	CCW_H3_L2,		CCW_H2_L1,		CCW_H3_L1,		CCW_H1_L3,		CCW_H1_L2,		CCW_H2_L3,	NULL_Switch}}; 


//霍尔换向表好用
const	void	(*startup_switch_table[2][8])() 		=	{	{NULL_Switch,	H2_L3,		H1_L2,		H1_L3,		H3_L1,		H2_L1,		H3_L2,	NULL_Switch},
																{NULL_Switch,	H3_L2,		H2_L1,		H3_L1,		H1_L3,		H1_L2,		H2_L3,	NULL_Switch}}; 

																
																

/* Public functions ----------------------------------------------------------*/
	/*---------------------------------------------------------------------------
	函数名称			：Hall_Convert(void)
	参数含义			：null
	函数功能			：读取Hall接口状态,PB6/7/8
	----------------------------------------------------------------------------*/
uint16_t	Hall_State_Read(void)
{
	uint16_t	Hall_Value;
	Hall_Value	=	(GPIOB->IDR >> 6)&0x07;
	return	Hall_Value;
}



/***********************************END OF FILE*********************************************/

